{
  "input": "productdata.csv",
  "output": "generated_html_pages",
  "top_n": 10,
  "keywords": [],
  "tag": "william0ae4-20",
  "seed": "",
  "site_name": "Top Product Guides By William",
  "site_url": "bestseoagencyforrealestateagents.com",
  "author_name": "William Adam",
  "author_role": "Product Research Team",
  "author_bio": "I analyze product data and structure guides to help buyers compare faster.",
  "contact_email": "Contact@topproductguides.com",
  "home_cards_limit": 250,
  "guides_page_size": 500,
  "related_links_count": 6,
  "sitemap_chunk_size": 40000,
  "indexnow_key": "62d4dc8092c646e885cce7946413abba",
  "indexnow_key_location": "",
  "indexnow_endpoint": "https://api.indexnow.org/indexnow",
  "indexnow_submit": true,
  "indexnow_batch_size": 10000,
  "page_copy": {
    "home_hero_kicker": "Top Product Guides By William",
    "home_hero_title": "{{site_name}}",
    "home_hero_intro": "Find structured comparisons with disclosure, author info, and buying guidance. Use search to quickly filter guides.",
    "home_search_placeholder": "Search a keyword (e.g. planner, solar lights...)",
    "home_latest_guides_title": "Latest Buying Guides",
    "home_important_pages_title": "Important Pages",
    "home_hidden_note_template": "{{hidden_count}} additional pages are available. <a href='all-guides.html'>Browse all guides</a>.",
    "guides_index_title": "All Buying Guides",
    "guides_index_intro": "Browse all generated guides. This index is paginated for crawl efficiency and better internal linking.",
    "guides_card_cta_text": "Open guide",
    "about_html": "<h1>About {{site_name}}</h1><p>This website publishes large-scale product comparison guides using structured data and repeatable editorial templates. Our goal is to help readers shortlist products faster without depending only on marketing claims.</p><h2>How We Build Content</h2><p>Each guide is generated from product-level inputs such as ratings, review counts, and ranking position. Then we apply a consistent layout that includes affiliate disclosure, buying guidance, FAQ, and author details.</p><p>We use a repeatable framework so the same evaluation logic can be applied across thousands of pages. This keeps structure, legal disclosures, and user experience consistent as the site scales.</p><h2>Editorial Intent</h2><p>We aim to present practical comparisons, common buying mistakes, and shortlist-focused recommendations. Content may be regenerated as source data changes, templates improve, or policy sections are updated.</p><h2>Corrections and Updates</h2><p>If you find factual errors, outdated details, or technical issues, contact us by email at <a href='mailto:{{contact_email}}'>{{contact_email}}</a>.</p>",
    "contact_html": "<h1>Contact Us</h1><p>For corrections, partnership inquiries, copyright concerns, and general questions, please contact us via email.</p><div class='contact-email-box'><strong>Email:</strong> <a href='mailto:{{contact_email}}'>{{contact_email}}</a></div><p>When contacting us, include the page URL and a short explanation so we can review your request faster.</p><p>We do not currently use a web form on this website. Email is the official contact channel.</p>",
    "disclosure_html": "<h1>Affiliate Disclosure</h1><p>This website participates in affiliate advertising programs, including Amazon Associates and similar partner networks.</p><p>When visitors click affiliate links and make qualifying purchases, we may earn a commission at no additional cost to the buyer.</p><p>Affiliate relationships do not change our commitment to transparent disclosures and structured comparison methods.</p><p>Product prices, stock availability, ratings, and reviews may change over time. Always verify current details on the merchant website before making a final purchase decision.</p><p>We aim to keep disclosures visible and understandable for readers so affiliate relationships remain clear across all pages.</p>",
    "editorial_html": "<h1>Editorial Policy</h1><h2>Selection Framework</h2><p>Guides are assembled from structured input datasets and consistency rules, including rank signals, review confidence, and feature relevance.</p><p>Templates are designed to maintain a consistent section order so readers can compare products quickly across different categories.</p><h2>Content Updates</h2><p>Pages may be regenerated when source data changes or when layout/policy improvements are deployed site-wide.</p><p>We may also revise introduction, FAQ, or guidance sections to improve clarity, readability, and compliance standards.</p><h2>Independence</h2><p>Affiliate commissions do not guarantee product placement. Ranking logic follows predefined data-driven rules.</p><p>Editorial and policy updates are applied at the template level to keep site-wide consistency without manual edits on each page.</p>",
    "privacy_html": "<h1>Privacy Policy</h1><p>This site may use analytics, server logs, and affiliate tracking parameters to understand traffic and link performance.</p><p>We do not intentionally collect sensitive personal data through article pages.</p><p>If you contact us by email, we may retain your message to respond, resolve issues, and keep an internal record of support requests.</p><p>Third-party services (such as affiliate networks) may process data under their own privacy policies.</p><p>Cookies and tracking technologies may be used by analytics or affiliate partners to measure site performance and referral attribution.</p><p>By continuing to use this site, you acknowledge these data-processing practices. If you have privacy-related questions, contact us by email at <a href='mailto:{{contact_email}}'>{{contact_email}}</a>.</p>",
    "terms_html": "<h1>Terms of Use</h1><p>All content is provided for informational purposes and may change without notice.</p><p>We do not guarantee completeness, merchant accuracy, or fitness for any specific purchase decision.</p><p>Before buying any product, you should verify product details, shipping, warranty, and return policy on the seller platform.</p><p>Unauthorized copying, bulk republishing, or automated scraping of this website content may violate applicable laws.</p><p>By using this website, you agree to evaluate products independently and use this information at your own discretion.</p><p>These terms may be updated periodically. Continued use of the site indicates acceptance of the latest version.</p>",
    "article_footer_note": "This page is for informational purposes and does not replace independent product research."
  }
}
